<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Домашнее задание — Основы программирования</title>
  <style>
    body { font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, Helvetica, Arial, "Noto Sans", "Liberation Sans", sans-serif;
           line-height: 1.6; margin: 2rem; max-width: 900px; }
    h1, h2, h3 { margin-top: 1.2em; }
    .lead { font-size: 1.05rem; }
    ol { padding-left: 1.2rem; }
    li { margin: 0.2rem 0; }
    .note { background: #f6f8fa; border: 1px solid #e5e7eb; padding: 1rem; border-radius: 8px; }
    .variants { columns: 1; }
    @media (min-width: 900px) {
      .variants { columns: 2; column-gap: 2rem; }
      .variants li { break-inside: avoid; }
    }
    footer { margin-top: 2rem; font-size: 0.9rem; color: #6b7280; }
  </style>
</head>
<body>
  <header>
    <h1>ДОМАШНЕЕ ЗАДАНИЕ</h1>
    <h2>Освоение низкоуровнего программирования</h2>
  </header>

  <section class="note">
    <p class="lead">Слова текста из малых латинских букв записаны не менее чем через один пробел; текст оканчивается точкой.</p>
    <p class="lead"><strong>БЕЗ ИСПОЛЬЗОВАНИЯ</strong> конструкции <code>STRING</code>, потокового ввода/вывода, функций <code>scanf()</code>/<code>printf()</code>:</p>
    <p>а) написать программу ввода такого текста с клавиатуры; (общий пункт для всех вариантов)</p>
  </section>

  <section>
    <h3>Варианты заданий</h3>
    <ol class="variants">
      <li><strong>Вариант 1.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью перенеся первую букву в конец слова.</li>
      <li><strong>Вариант 2.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью удалив из слова последнюю букву.</li>
      <li><strong>Вариант 3.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью удалив из слова все последующие вхождения первой буквы.</li>
      <li><strong>Вариант 4.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью удалив из слова все предыдущие вхождения последней буквы.</li>
      <li><strong>Вариант 5.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью оставив в слове только первые вхождения каждой буквы.</li>
      <li><strong>Вариант 6.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью (если слово нечетной длины) удалив его среднюю букву.</li>
      <li><strong>Вариант 7.</strong> б) напечатать все слова, отличающиеся от последнего слова, и одновременно симметричные.</li>
      <li><strong>Вариант 8.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которые первая буква печатаемого слова входит в него еще только один раз.</li>
      <li><strong>Вариант 9.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которых буквы упорядочены по алфавиту.</li>
      <li><strong>Вариант 10.</strong> б) напечатать все слова, отличающиеся от последнего слова, и совпадающие с начальным отрезком алфавита (a, ab, abc и т.д.).</li>
      <li><strong>Вариант 11.</strong> б) напечатать все слова, отличающиеся от последнего слова, и совпадающие с конечным отрезком алфавита (z, yz, xyz и т.д.).</li>
      <li><strong>Вариант 12.</strong> б) напечатать все слова, отличающиеся от последнего слова, и имеющие максимальную длину.</li>
      <li><strong>Вариант 13.</strong> б) напечатать все слова, отличающиеся от последнего слова, и не содержащие повторяющихся букв.</li>
      <li><strong>Вариант 14.</strong> б) напечатать все слова, отличающиеся от последнего слова, и в которые каждая буква входит не менее двух раз.</li>
      <li><strong>Вариант 15.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которых гласные буквы (a, e, i, o, u, y) чередуются с согласными.</li>
      <li><strong>Вариант 16.</strong> б) напечатать слова текста в обратном порядке букв.</li>
      <li><strong>Вариант 17.</strong> б) напечатать этот текст, удалив все повторные вхождения слов.</li>
      <li><strong>Вариант 18.</strong> б) напечатать все слова, входящие в текст по одному разу.</li>
      <li><strong>Вариант 19.</strong> б) напечатать все различные слова текста, указав для каждого из них количество его вхождений в текст.</li>
      <li><strong>Вариант 20.</strong> б) напечатать слова текста в алфавитном порядке.</li>
      <li><strong>Вариант 21.</strong> б) напечатать все слова, отличающиеся от последнего слова, и совпадающие с конечным отрезком алфавита (z, yz, xyz и т.д.).</li>
      <li><strong>Вариант 22.</strong> б) напечатать все слова, отличающиеся от последнего слова, и имеющие максимальную длину.</li>
      <li><strong>Вариант 23.</strong> б) напечатать все слова, отличающиеся от последнего слова, и не содержащие повторяющихся букв.</li>
      <li><strong>Вариант 24.</strong> б) напечатать все слова, отличающиеся от последнего слова, и в которые каждая буква входит не менее двух раз.</li>
      <li><strong>Вариант 25.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которых гласные буквы (a, e, i, o, u, y) чередуются с согласными.</li>
    </ol>
  </section>

  <footer>
    <p>Кафедра ИУ5 МГТУ им. Н.&nbsp;Э.&nbsp;Баумана — курс «Основы программирования».</p>
  </footer>
</body>
</html>
